Problem C: 导弹系统

Time Limit: 3 Sec  Memory Limit: 128 MB
Submit: 289  Solved: 76
[Submit][Status][Web Board]
Description

小熊国研发出一种新的导弹拦截系统。但是这种导弹拦截系统有一个缺陷：虽然它的第一发炮弹能够到达任意的高度，但是以后每一发炮弹都不能高于前一发的高度。某天，雷达捕捉到敌国的导弹来袭。由于该系统还在试用阶段，所以只有一套系统，因此有可能不能拦截所有的导弹。

Input

第一行为一个整数N，表示飞来的导弹个数，N<=100000

第二行为N个整数，依次表示导弹飞来的高度，高度数据为不大于30000的正整数

Output

第一行，输出计算这套系统最多能拦截多少导弹

第二行，输出要拦截所有导弹最少要配备多少套这种导弹拦截系统。

Sample Input

8
389 207 155 300 299 170 158 65
Sample Output

6
2
HINT
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
